app/controllers/calls_controller.rb

SELECT "calls".* FROM "calls"
---
  def index
     @calls = Call.all

UPDATE "calls" SET "detail" = $1, "updated_at" = $2 WHERE "calls"."id" = $3  [["detail", "llamada de consulta g"], ["updated_at", "2023-09-03 22:47:08.414570"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @call.update(call_params)

SELECT "calls".* FROM "calls" WHERE "calls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_call
      @call = Call.find(params[:id])